In [ ]:
import pandas as pd

In [3]:
s=pd.Series([10,20,30,40])
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
print(s[0])

10

## Custom Index

In [5]:
s=pd.Series([10,20,30],index=["a","b","c"])
print(s)

a    10
b    20
c    30
dtype: int64

In [6]:
print(s["a"])

10

In [7]:
print(s[0])

10

C:\Users\BISWAJEET KUMAR\AppData\Local\Temp\ipykernel_15792\287792665.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s[0])

### Series from Dictionary

In [8]:
data={"Math": 90, "Physics": 98,"Chemistry": 88}

In [9]:
marks=pd.Series(data)

In [10]:
print(data)

{'Math': 90, 'Physics': 98, 'Chemistry': 88}

In [11]:
print(marks)

Math         90
Physics      98
Chemistry    88
dtype: int64

## DataFrame in pandas

In [12]:
data={
    "Name": ["Raju","Bheem","Chutki"],
    "Age": [9,24,17],
    "Marks": [65,90,69]
}

In [13]:
print(data)

{'Name': ['Raju', 'Bheem', 'Chutki'], 'Age': [9, 24, 17], 'Marks': [65, 90, 69]}

In [14]:
type(data)

dict

In [15]:
df=pd.DataFrame(data)

In [18]:
print(df) ##Pandas automatically adds a default index: this is called a range Index(Start from 0 by default)

     Name  Age  Marks
0    Raju    9     65
1   Bheem   24     90
2  Chutki   17     69

In [21]:
#we can also add custom index in pandas dataframe
df= pd.DataFrame(
    data,
    index =["Student 1","Student 2","Student 3"]
)

In [22]:
print(df)

             Name  Age  Marks
Student 1    Raju    9     65
Student 2   Bheem   24     90
Student 3  Chutki   17     69

In [ ]:
df.set_index("Name",inplace=True) #if we are setting in place = true it means we are changing the original object it self. if we do this without inplace it will create a new dataframe

In [25]:
print(df)

        Age  Marks
Name
Raju      9     65
Bheem    24     90
Chutki   17     69

In [8]:
df=pd.DataFrame({
    "Name": ["Raju","Bheem","Chutki","Kalia","Indumati"],
    "Age": [9,24,17,20,30],
    "Marks": [65,90,69,85,78]
})

In [9]:
df.head(2)

    Name  Age  Marks
0   Raju    9     65
1  Bheem   24     90

In [10]:
df.tail(2)

       Name  Age  Marks
3     Kalia   20     85
4  Indumati   30     78

In [12]:
df.shape

(5, 3)

In [13]:
df.columns

Index(['Name', 'Age', 'Marks'], dtype='object')

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   Marks   5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [17]:
df.describe().T

       count  mean        std   min   25%   50%   75%   max
Age      5.0  20.0   7.842194   9.0  17.0  20.0  24.0  30.0
Marks    5.0  77.4  10.502381  65.0  69.0  78.0  85.0  90.0

## Selecting the data

In [18]:
df["Name"]

0        Raju
1       Bheem
2      Chutki
3       Kalia
4    Indumati
Name: Name, dtype: object

In [20]:
df[["Name","Marks"]]

       Name  Marks
0      Raju     65
1     Bheem     90
2    Chutki     69
3     Kalia     85
4  Indumati     78

#### Filtering in pandas

In [22]:
df[df["Marks"]>85]

    Name  Age  Marks
1  Bheem   24     90

In [23]:
df[(df["Age"]>21)&(df["Marks"]>80)] ##multiple conditions in pandas dataframe

    Name  Age  Marks
1  Bheem   24     90

### Sortings + Value Counts

In [26]:
df.sort_values("Marks",ascending=False) ##sort the dataframe based on marks in descending order

       Name  Age  Marks
1     Bheem   24     90
3     Kalia   20     85
4  Indumati   30     78
2    Chutki   17     69
0      Raju    9     65

In [27]:
df.sort_values("Marks")

       Name  Age  Marks
0      Raju    9     65
2    Chutki   17     69
4  Indumati   30     78
3     Kalia   20     85
1     Bheem   24     90

In [29]:
df["Age"].value_counts() ##to count the number of unique values in a column

Age
9     1
24    1
17    1
20    1
30    1
Name: count, dtype: int64

### Handling Missing values

In [34]:
##Updating the dataframe with some null values
df=pd.DataFrame({
    "Name": ["Raju","Bheem","Chutki","Kalia",None,"Indumati"],
    "Age": [9,24,17,20,30,None],
    "Marks": [65,None,69,85,78,None]
})

df

       Name   Age  Marks
0      Raju   9.0   65.0
1     Bheem  24.0    NaN
2    Chutki  17.0   69.0
3     Kalia  20.0   85.0
4      None  30.0   78.0
5  Indumati   NaN    NaN

In [35]:
df.isnull() ##to check for null values in the dataframe

    Name    Age  Marks
0  False  False  False
1  False  False   True
2  False  False  False
3  False  False  False
4   True  False  False
5  False   True   True

In [36]:
df.isnull().sum() ##to count the number of null values in each column

Name     1
Age      1
Marks    2
dtype: int64

In [ ]:
df.dropna()

     Name   Age  Marks
0    Raju   9.0   65.0
2  Chutki  17.0   69.0
3   Kalia  20.0   85.0

In [38]:
print(df)

       Name   Age  Marks
0      Raju   9.0   65.0
1     Bheem  24.0    NaN
2    Chutki  17.0   69.0
3     Kalia  20.0   85.0
4      None  30.0   78.0
5  Indumati   NaN    NaN

In [39]:
clean_df=df.dropna() ##to create a new dataframe without null values

In [40]:
print(clean_df)

     Name   Age  Marks
0    Raju   9.0   65.0
2  Chutki  17.0   69.0
3   Kalia  20.0   85.0